** Adding new users

Use the gui tool (system-config-users) to add new users and configure groups.

#+BEGIN_SRC sh
sudo 
#+END_SRC

#+BEGIN_SRC emacs-lisp
(load-file "gilgamesh-cmds.el")
(sudo "/usr/bin/system-config-users")
#+END_SRC
#+RESULTS:
: 1

Use the command

#+BEGIN_SRC sh
chage -d 0 userid
#+END_SRC	

to force the users to change their passwords on login.

I recommend you use a site like http://makeagoodpassword.com to generate reasonable passwords.

